app/controllers/subscription_admin/accounts_controller.rb

  def index
    @accounts = Account.paginate(:include => :subscription, :page => params[:page], :per_page => 30, :order => 'accounts.name')
---
SELECT * FROM `accounts` WHERE (accounts.deleted_at IS NULL OR accounts.deleted_at > '2009-06-01 20:11:39') ORDER BY accounts.name LIMIT 0, 30
SELECT `subscriptions`.* FROM `subscriptions` WHERE (`subscriptions`.account_id = 1)