app/controllers/subscription_admin/subscriptions_controller.rb

  def index
    @stats = SubscriptionPayment.stats if params[:page].blank?
---
SELECT sum(`subscription_payments`.amount) AS sum_amount FROM `subscription_payments` WHERE (`subscription_payments`.`created_at` BETWEEN '2009-05-01 00:00:00' AND '2009-05-31 23:59:59')