app/controllers/subscription_admin/subscription_plans_controller.rb

SELECT * FROM `subscription_plans` WHERE (`subscription_plans`.`name` = 'Basic') LIMIT 1
---
    def load_object
      @obj = @subscription_plan = SubscriptionPlan.find_by_name(params[:id])