app/controllers/accounts_controller.rb

  def create
    if @account.needs_payment_info?
      @address.first_name = @creditcard.first_name
      @address.last_name = @creditcard.last_name
      @account.address = @address
      @account.creditcard = @creditcard
    end

    if @account.save
---
INSERT INTO `accounts` (`name`, `full_domain`, `created_at`, `updated_at`, `deleted_at`) VALUES('aapam', 'aapam.RecruitApp.com', '2009-06-01 20:19:24', '2009-06-01 20:19:24', NULL)

  def plan
    if request.post?
      @subscription.plan = SubscriptionPlan.find(params[:plan_id])
---
SELECT * FROM `subscription_plans` WHERE (`subscription_plans`.`id` = 1)

      end
      redirect_to :action => "plan"
    else
      @plans = SubscriptionPlan.find(:all, :conditions => ['id <> ?', @subscription.subscription_plan_id], :order => 'amount desc').collect {|p| p.discount = @subscription.discount; p }
---
SELECT * FROM `subscriptions` WHERE (`subscriptions`.account_id = 1) LIMIT 1