app/controllers/companies_controller.rb

INSERT INTO `companies` (`name`, `created_at`, `updated_at`, `account_id`, `address_id`, `description`) VALUES(NULL, '2009-06-14 21:26:38', '2009-06-14 21:26:38', 3, NULL, NULL)
---
  def create
    @company = current_account.companies.new(params[:company])

    respond_to do |format|
      if @company.save

SELECT * FROM `companies` WHERE (`companies`.account_id = 3) LIMIT 0, 1
SELECT count(*) AS count_all FROM `companies` WHERE (`companies`.account_id = 3)
---
  def index
    @companies = current_account.companies.paginate(:page => params[:page])

SELECT * FROM `companies` WHERE (`companies`.`id` = 1 AND (`companies`.account_id = 3))
---
  def load_company
    @company = current_account.companies.find(params[:id])